lines = '''Аудит. Краткий курс. Учебное пособие.  //Окей-книга, 204. //978-5-409-00586-3
Аудит. Практикум. Учебное пособие. //Юрайт, 2013. //978-5-9916—2408-4
Аудит. Теория и практика. Учебник/Под ред. Н.А. Казаковой. // Юрайт, 2014. //978-5-9916—3287-4
Аудит. Учебник/Под ред. Т.М. Рогуленко. // Юрайт, 2013. //978-5-9916—2877-8
В.М. Лемеш Ревизия и аудит/В.М. Лемеш. // Издательство Гревцова, 2013. //978-985-6954-52-1
Герасимова Л.Н. Профессиональные ценности и этика бухгалтеров и аудиторов. Учебник/Л.Н. Герасимова. // Юрайт, 2014.  //978-5-9916—3731-2
Дмитриева И.М. Бухгалтерский учет и аудит. Учебное пособие/И.М. Дмитриева. // Юрайт, 2014. //978-5-9916—2817-4
Ерофеева В.А.  Аудит. Учебное пособие/В.А. Ерофеева. // Юрайт, 2014. //978-5-9916—1592-1
Ерофеева В.А. Аудит. Краткий курс лекций/В.А. Ерофеева. // Юрайт, 2014. //978-5-9916—2601-9
Карагод В. С. Аудит. Теория и практика. Учебник/В. С. Карагод. // Юрайт, 2014. //978-5-9916—1792-5
Лебедева Е.М. Аудит. Практикум. Учебное пособие/Е.М. Лебедева.  // Академия, 2014. //978-5-4468—0815-1
12.Лебедева Е.М. Аудит. Учебник/Е.М. Лебедева. // Академия, 2013. //978-5-4468—0522-8
Международные стандарты аудита/Под ред. Ж.А. Кеворковой. // Юрайт, 2014. //978-5-9916—3086-3.
Рогуленко Т.М. Аудит. Учебник/Т.М. Рогуленко. // КноРус, 2014. //978-5-406-03629-7
Рогуленко Т.М. Основы аудита/Т.М. Рогуленко. // Флинта, 2013. //978-5-9765—1320-4
Савин А.А. Аудит/А.А. Савин. // Инфра-М, 2013. //978-5-905554-14-8
Федоренко И.В. Аудит/И.В. Федоренко. // Инфра-М, 2013. //978-5-16-005015-7'''

split_line = lines.split('\n')
list_of_lines = list(map(lambda line: line.split('//'), split_line))
firstTable = list(map(lambda item:
                      '({}, \'{}\', \'{}\'),'
                      .format(list_of_lines.index(item)+1, item[0].strip(), item[-1].strip()),
                      list_of_lines))
secondTable = list(map(lambda item:
                       '({}, \'{}\', \'{}\'),'
                       .format(list_of_lines.index(item)+1, item[1].strip(), 'RU'),
                       list_of_lines))
print('\n'.join(firstTable))
print('\n'.join(secondTable))